versaloon/vsf_orig/vsf/interfaces/cpu/stm32/usbd/STM32_USBD.c
	if (stm32_interface_get_info(&stm32_info))
	{
		return VSFERR_FAIL;
	}
	switch (stm32_info->sys_freq_hz)
	{
	case 72 * 1000 * 1000:
		RCC->CFGR &= ~STM32_RCC_CFGR_USBPRE;
		break;
	case 48 * 1000 * 1000:
		RCC->CFGR |= STM32_RCC_CFGR_USBPRE;
		break;
	default:
		return VSFERR_INVALID_PARAMETER;
	}
	RCC->APB1ENR |= STM32_RCC_APB1ENR_USBEN;
	
	irqn = USB_HP_CAN1_TX_IRQn;
	NVIC->IP[irqn] = int_priority;
	NVIC->ISER[irqn >> 0x05] = 1UL << (irqn & 0x1F);
	irqn = USB_LP_CAN1_RX0_IRQn;
	NVIC->IP[irqn] = int_priority;
	NVIC->ISER[irqn >> 0x05] = 1UL << (irqn & 0x1F);
	
	// reset
	*CNTR = USB_CNTR_FRES;
	*CNTR = 0;
	
	// It seems that there MUST be at least 8 clock cycles
	// between clear FRES and clear ISTR, or RESET flash can't be cleared
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	__asm("nop");
	*ISTR = 0;
	*CNTR = USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_ERRM |
				USB_CNTR_RESETM;
	*BTABLE = 0;
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_fini(void)
{
	uint8_t irqn;
	// reset
	*CNTR = USB_CNTR_FRES;
	*ISTR = 0;
	
	*CNTR = USB_CNTR_FRES | USB_CNTR_PDWN;
	irqn = USB_HP_CAN1_TX_IRQn;
	NVIC->ICER[irqn >> 0x05] = 1UL << (irqn & 0x1F);
	irqn = USB_LP_CAN1_RX0_IRQn;
	NVIC->ICER[irqn >> 0x05] = 1UL << (irqn & 0x1F);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_reset(void)
{
	return VSFERR_NONE;
}

void USB_Istr(void);
vsf_err_t stm32_usbd_poll(void)
{
	USB_Istr();
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_connect(void)
{
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_disconnect(void)
{
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_set_address(uint8_t address)
{
	*DADDR = address | USB_DADDR_EF;
	return VSFERR_NONE;
}

uint8_t stm32_usbd_get_address(void)
{
	return *DADDR & USB_DADDR_ADD;
}

vsf_err_t stm32_usbd_suspend(void)
{
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_resume(void)
{
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_lowpower(uint8_t level)
{
	return VSFERR_NONE;
}

uint32_t stm32_usbd_get_frame_number(void)
{
	return *FNR & 0x7FF;
}

vsf_err_t stm32_usbd_get_setup(uint8_t *buffer)
{
	if (8 != stm32_usbd_ep_get_OUT_count(0))
	{
		return VSFERR_FAIL;
	}
	
	return stm32_usbd_ep_read_OUT_buffer(0, buffer, 8);
}

vsf_err_t stm32_usbd_prepare_buffer(void)
{
	EP_Cfg_Ptr = 0x200;
	return VSFERR_NONE;
}

static int8_t stm32_usbd_ep(uint8_t idx)
{
	uint8_t i;
	
	for (i = 0; i < sizeof(stm32_usbd_epaddr); i++)
	{
		if (idx == stm32_usbd_epaddr[i])
		{
			return (int8_t)i;
		}
	}
	return -1;
}

static int8_t stm32_usbd_get_ep(uint8_t idx)
{
	int8_t i;
	
	i = stm32_usbd_ep(idx);
	if (i >= 0)
	{
		return i;
	}
	
	for (i = 0; i < sizeof(stm32_usbd_epaddr); i++)
	{
		if (-1 == stm32_usbd_epaddr[i])
		{
			stm32_usbd_epaddr[i] = idx;
			SetEPAddress(i, idx);
			return i;
		}
	}
	return -1;
}

vsf_err_t stm32_usbd_ep_reset(uint8_t idx)
{
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_set_type(uint8_t idx, enum interface_usbd_eptype_t type)
{
	int8_t index;
	
	index = stm32_usbd_get_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	switch (type)
	{
	case USB_EP_TYPE_CONTROL:
		SetEPType(idx, EP_CONTROL);
		ClearStatusOut(idx);
		break;
	case USB_EP_TYPE_INTERRUPT:
		SetEPType(idx, EP_INTERRUPT);
		break;
	case USB_EP_TYPE_BULK:
		SetEPType(idx, EP_BULK);
		ClearEPDoubleBuff(idx);
		break;
	case USB_EP_TYPE_ISO:
		SetEPType(idx, EP_ISOCHRONOUS);
		break;
	default:
		return VSFERR_INVALID_PARAMETER;
	}
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_set_IN_dbuffer(uint8_t idx)
{
	uint16_t epsize = stm32_usbd_ep_get_IN_epsize(idx);
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if ((EP_Cfg_Ptr - epsize) < STM32_USBD_EP_NUM * 8)
	{
		return VSFERR_NOT_ENOUGH_RESOURCES;
	}
	EP_Cfg_Ptr -= epsize;
	
	SetEPDoubleBuff(idx);
	SetEPDblBuffAddr(idx, GetEPTxAddr(idx), EP_Cfg_Ptr);
	SetEPDblBuffCount(idx, true, 0);
	ClearDTOG_RX(idx);
	ClearDTOG_TX(idx);
	SetEPRxStatus(idx, USB_EPRX_STAT_DIS);
	SetEPTxStatus(idx, USB_EPTX_STAT_NAK);
	stm32_usbd_IN_dbuffer[idx] = true;
	return VSFERR_NONE;
}

bool stm32_usbd_ep_is_IN_dbuffer(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return false;
	}
	idx = (uint8_t)index;
	return stm32_usbd_IN_dbuffer[idx];
}

vsf_err_t stm32_usbd_ep_switch_IN_buffer(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	FreeUserBuffer(idx, true);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_set_IN_epsize(uint8_t idx, uint16_t epsize)
{
	int8_t index;
	
	index = stm32_usbd_get_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if ((EP_Cfg_Ptr - epsize) < STM32_USBD_EP_NUM * 8)
	{
		return VSFERR_NOT_ENOUGH_RESOURCES;
	}
	
	stm32_usbd_IN_epsize[idx] = epsize;
	SetEPTxCount(idx, epsize);
	// fix for 16-bit aligned memory
	EP_Cfg_Ptr -= epsize & 1 ? epsize + 1 : epsize;
	SetEPTxAddr(idx, EP_Cfg_Ptr);
	SetEPTxStatus(idx, USB_EPTX_STAT_NAK);
	return VSFERR_NONE;
}

uint16_t stm32_usbd_ep_get_IN_epsize(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return 0;
	}
	idx = (uint8_t)index;
	return stm32_usbd_IN_epsize[idx];
}

vsf_err_t stm32_usbd_ep_set_IN_stall(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	SetEPTxStatus(idx, USB_EPTX_STAT_STALL);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_clear_IN_stall(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	SetEPTxStatus(idx, USB_EPTX_STAT_NAK);
	return VSFERR_NONE;
}

bool stm32_usbd_ep_is_IN_stall(uint8_t idx)
{
	int8_t index;
	
