versaloon/vsf_orig/vsf/interfaces/cpu/stm32/usbd/STM32_USBD.c
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return false;
	}
	idx = (uint8_t)index;
	
	return (USB_EPTX_STAT_STALL == (EP0REG[idx] & USB_EP0R_STAT_TX));
}

vsf_err_t stm32_usbd_ep_reset_IN_toggle(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	ClearDTOG_TX(idx);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_toggle_IN_toggle(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	ToggleDTOG_TX(idx);
	return VSFERR_NONE;
}


vsf_err_t stm32_usbd_ep_set_IN_count(uint8_t idx, uint16_t size)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if (stm32_usbd_IN_dbuffer[idx])
	{
		if(EP0REG[idx] & USB_EP0R_DTOG_RX)
		{
			SetEPDblBuf1Count(idx, true, size);
		}
		else
		{
			SetEPDblBuf0Count(idx, true, size);
		}
	}
	else
	{
		SetEPTxCount(idx, size);
	}
	SetEPTxStatus(idx, USB_EPTX_STAT_VALID);
	return VSFERR_NONE;
}

static void stm32_usr2pma_copy(uint8_t *usr, uint16_t pma_addr, uint16_t bytes)
{
	uint16_t i;
	uint16_t *pma_ptr;
	
	pma_ptr = (uint16_t *)(pma_addr * 2 + PMAAddr);
	for (i = ((bytes + 1) >> 1); i > 0; i--)
	{
		*pma_ptr = usr[0] + (usr[1] << 8);
		pma_ptr += 2;
		usr += 2;
	}
}

vsf_err_t stm32_usbd_ep_write_IN_buffer(uint8_t idx, uint8_t *buffer,
										uint16_t size)
{
	uint32_t PMA_ptr;
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if (stm32_usbd_IN_dbuffer[idx])
	{
		if(EP0REG[idx] & USB_EP0R_DTOG_RX)
		{
			PMA_ptr = GetEPDblBuf1Addr(idx);
		}
		else
		{
			PMA_ptr = GetEPDblBuf0Addr(idx);
		}
	}
	else
	{
		PMA_ptr = GetEPTxAddr(idx);
	}
	stm32_usr2pma_copy(buffer, PMA_ptr, size);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_set_OUT_dbuffer(uint8_t idx)
{
	uint16_t epsize = stm32_usbd_ep_get_OUT_epsize(idx);
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if ((EP_Cfg_Ptr - epsize) < STM32_USBD_EP_NUM * 8)
	{
		return VSFERR_NOT_ENOUGH_RESOURCES;
	}
	EP_Cfg_Ptr -= epsize;
	
	SetEPDoubleBuff(idx);
	SetEPDblBuffAddr(idx, GetEPRxAddr(idx), EP_Cfg_Ptr);
	SetEPDblBuffCount(idx, false, epsize);
	ClearDTOG_RX(idx);
	ClearDTOG_TX(idx);
	ToggleDTOG_TX(idx);
	SetEPRxStatus(idx, USB_EPRX_STAT_VALID);
	SetEPTxStatus(idx, USB_EPTX_STAT_DIS);
	stm32_usbd_OUT_dbuffer[idx] = true;
	return VSFERR_NONE;
}

bool stm32_usbd_ep_is_OUT_dbuffer(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return false;
	}
	idx = (uint8_t)index;
	return stm32_usbd_OUT_dbuffer[idx];
}

vsf_err_t stm32_usbd_ep_switch_OUT_buffer(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	FreeUserBuffer(idx, false);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_set_OUT_epsize(uint8_t idx, uint16_t epsize)
{
	bool ep0;
	int8_t index;
	
	index = stm32_usbd_get_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	ep0 = 0 == idx;
	idx = (uint8_t)index;
	
	if ((EP_Cfg_Ptr - epsize) < STM32_USBD_EP_NUM * 8)
	{
		return VSFERR_NOT_ENOUGH_RESOURCES;
	}
	
	stm32_usbd_OUT_epsize[idx] = epsize;
	SetEPRxCount(idx, epsize);
	// fix for 16-bit aligned memory
	EP_Cfg_Ptr -= epsize & 1 ? epsize + 1 : epsize;
	SetEPRxAddr(idx, EP_Cfg_Ptr);
	if (ep0)
	{
		SetEPRxStatus(idx, USB_EPRX_STAT_VALID);
	}
	else
	{
		SetEPRxStatus(idx, USB_EPRX_STAT_NAK);
	}
	return VSFERR_NONE;
}

uint16_t stm32_usbd_ep_get_OUT_epsize(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return 0;
	}
	idx = (uint8_t)index;
	return stm32_usbd_OUT_epsize[idx];
}

vsf_err_t stm32_usbd_ep_set_OUT_stall(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	SetEPRxStatus(idx, USB_EPRX_STAT_STALL);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_clear_OUT_stall(uint8_t idx)
{
	int8_t index;
	bool ep0;
	
	index = stm32_usbd_ep(idx);
	ep0 = 0 == idx;
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	if (ep0)
	{
		SetEPRxStatus(idx, USB_EPRX_STAT_VALID);
	}
	else
	{
		SetEPRxStatus(idx, USB_EPRX_STAT_NAK);
	}
	return VSFERR_NONE;
}

bool stm32_usbd_ep_is_OUT_stall(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return false;
	}
	idx = (uint8_t)index;
	
	return (USB_EPRX_STAT_STALL == (EP0REG[idx] & USB_EP0R_STAT_RX));
}

vsf_err_t stm32_usbd_ep_reset_OUT_toggle(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	ClearDTOG_RX(idx);
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_toggle_OUT_toggle(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	ToggleDTOG_RX(idx);
	return VSFERR_NONE;
}

uint16_t stm32_usbd_ep_get_OUT_count(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return 0;
	}
	idx = (uint8_t)index;
	
	if (stm32_usbd_OUT_dbuffer[idx])
	{
		if(EP0REG[idx] & USB_EP0R_DTOG_TX)
		{
			return GetEPDblBuf1Count(idx);
		}
		else
		{
			return GetEPDblBuf0Count(idx);
		}
	}
	else
	{
		return GetEPRxCount(idx);
	}
}

static void stm32_pma2usr_copy(uint8_t *usr, uint16_t pma_addr, uint16_t bytes)
{
	uint16_t data;
	uint32_t *pma_ptr;
	
	pma_ptr = (uint32_t *)(pma_addr * 2 + PMAAddr);
	while (bytes > 0)
	{
		data = *pma_ptr++;
		if (bytes > 1)
		{
			*(uint16_t*)usr = data;
			usr += 2;
			bytes -= 2;
		}
		else
		{
			*usr = data;
			bytes -= 1;
		}
	}
}

vsf_err_t stm32_usbd_ep_read_OUT_buffer(uint8_t idx, uint8_t *buffer,
										uint16_t size)
{
	int8_t index;
	
