versaloon/vsf_orig/vsf/interfaces/cpu/stm32/usbd/STM32_USBD.c
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	if (stm32_usbd_OUT_dbuffer[idx])
	{
		if(EP0REG[idx] & USB_EP0R_DTOG_TX)
		{
			stm32_pma2usr_copy(buffer, GetEPDblBuf1Addr(idx), size);
		}
		else
		{
			stm32_pma2usr_copy(buffer, GetEPDblBuf0Addr(idx), size);
		}
	}
	else
	{
		stm32_pma2usr_copy(buffer, GetEPRxAddr(idx), size);
	}
	return VSFERR_NONE;
}

vsf_err_t stm32_usbd_ep_enable_OUT(uint8_t idx)
{
	int8_t index;
	
	index = stm32_usbd_ep(idx);
	if (index < 0)
	{
		return VSFERR_FAIL;
	}
	idx = (uint8_t)index;
	
	SetEPRxStatus(idx, USB_EPRX_STAT_VALID);
	return VSFERR_NONE;
}






void CTR_LP(void)
{
	uint8_t EPindex;
	int8_t epaddr;
	uint16_t wIstr;
	volatile uint16_t wEPVal = 0;
	
	while (((wIstr = *ISTR) & USB_ISTR_CTR) != 0)
	{
		EPindex = (uint8_t)(wIstr & USB_ISTR_EP_ID);
		epaddr = stm32_usbd_epaddr[EPindex];
		
		if (epaddr == 0)
		{
			if ((wIstr & USB_ISTR_DIR) == 0)
			{
				ClearEP_CTR_TX(0);
				if (stm32_usbd_callback.on_in != NULL)
				{
					stm32_usbd_callback.on_in(stm32_usbd_callback.param,
												epaddr);
				}
				return;
			}
			else
			{
				wEPVal = EP0REG[0];
				ClearEP_CTR_RX(0);
				if ((wEPVal & USB_EP0R_SETUP) != 0)
				{
					if (stm32_usbd_callback.on_setup != NULL)
					{
						stm32_usbd_callback.on_setup(stm32_usbd_callback.param);
					}
				}
				else if ((wEPVal & USB_EP0R_CTR_RX) != 0)
				{
					if (stm32_usbd_callback.on_out != NULL)
					{
						stm32_usbd_callback.on_out(stm32_usbd_callback.param,
													epaddr);
					}
				}
				return;
			}
		}
		else
		{
			wEPVal = EP0REG[EPindex];
			if ((wEPVal & USB_EP0R_CTR_RX) != 0)
			{
				ClearEP_CTR_RX(EPindex);
				if ((stm32_usbd_callback.on_out != NULL) && (epaddr >= 0))
				{
					stm32_usbd_callback.on_out(stm32_usbd_callback.param,
												epaddr);
				}
			}
			if ((wEPVal & USB_EP0R_CTR_TX) != 0)
			{
				ClearEP_CTR_TX(EPindex);
				if ((stm32_usbd_callback.on_in != NULL) && (epaddr >= 0))
				{
					stm32_usbd_callback.on_in(stm32_usbd_callback.param,
												epaddr);
				}
			}
		}
	}
}

void CTR_HP(void)
{
	uint8_t EPindex;
	int8_t epaddr;
	uint16_t wIstr;
	uint32_t wEPVal = 0;
	
	while (((wIstr = *ISTR) & USB_ISTR_CTR) != 0)
	{
		*ISTR = ~USB_ISTR_CTR;
		
		EPindex = (uint8_t)(wIstr & USB_ISTR_EP_ID);
		epaddr = stm32_usbd_epaddr[EPindex];
		wEPVal = EP0REG[EPindex];
		if ((wEPVal & USB_EP0R_CTR_RX) != 0)
		{
			ClearEP_CTR_RX(EPindex);
			if ((stm32_usbd_callback.on_out != NULL) && (epaddr >= 0))
			{
				stm32_usbd_callback.on_out(stm32_usbd_callback.param, epaddr);
			}
		}
		else if ((wEPVal & USB_EP0R_CTR_TX) != 0)
		{
			ClearEP_CTR_TX(EPindex);
			if ((stm32_usbd_callback.on_in != NULL) && (epaddr >= 0))
			{
				stm32_usbd_callback.on_in(stm32_usbd_callback.param, epaddr);
			}
		}
	}
}

void USB_Istr(void)
{
	uint16_t wIstr = *ISTR;
	
	if (wIstr & USB_ISTR_RESET)
	{
		*ISTR = ~USB_ISTR_RESET;
		if (stm32_usbd_callback.on_reset != NULL)
		{
			stm32_usbd_callback.on_reset(stm32_usbd_callback.param);
		}
	}
	if (wIstr & USB_ISTR_PMAOVR)
	{
		*ISTR = ~USB_ISTR_PMAOVR;
	}
	if (wIstr & USB_ISTR_ERR)
	{
		*ISTR = ~USB_ISTR_ERR;
		if (stm32_usbd_callback.on_error != NULL)
		{
			stm32_usbd_callback.on_error(stm32_usbd_callback.param,
											USBERR_ERROR);
		}
	}
	if (wIstr & USB_ISTR_WKUP)
	{
		*ISTR = ~USB_ISTR_WKUP;
		if (stm32_usbd_callback.on_wakeup != NULL)
		{
			stm32_usbd_callback.on_wakeup(stm32_usbd_callback.param);
		}
	}
	if (wIstr & USB_ISTR_SUSP)
	{
		if (stm32_usbd_callback.on_suspend != NULL)
		{
			stm32_usbd_callback.on_suspend(stm32_usbd_callback.param);
		}
		*ISTR = ~USB_ISTR_SUSP;
	}
	if (wIstr & USB_ISTR_SOF)
	{
		*ISTR = ~USB_ISTR_SOF;
		if (stm32_usbd_callback.on_sof != NULL)
		{
			stm32_usbd_callback.on_sof(stm32_usbd_callback.param);
		}
	}
	if (wIstr & USB_ISTR_ESOF)
	{
		*ISTR = ~USB_ISTR_ESOF;
		if (stm32_usbd_callback.on_error != NULL)
		{
			stm32_usbd_callback.on_error(stm32_usbd_callback.param,
											USBERR_SOF_TO);
		}
	}
	if (wIstr & USB_ISTR_CTR)
	{
		CTR_LP();
	}
}

ROOTFUNC void USB_LP_CAN1_RX0_IRQHandler(void)
{
	USB_Istr();
}

ROOTFUNC void USB_HP_CAN1_TX_IRQHandler(void)
{
	CTR_HP();
}

ROOTFUNC void USBWakeUp_IRQHandler(void)
{
}

#endif
